In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:password@localhost:3306/md_water_services

---
## Looking at all the tables in the database

In [ ]:
%%sql
SELECT * FROM md_water_services.data_dictionary;

In [5]:
%%sql

SHOW TABLES FROM md_water_services;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
8 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

----
## 1. Employees table
### let us check for descrepancies in our employess table and correct them

In [27]:
%%sql
SELECT *
FROM
    md_water_services.employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

### 1a. 
we can observe our emails column is empty so we use the employess name with @ndogowater.gov and also replace the space in the name with a dot.
we can carry out this query by making use of the REPLACE(), LOWER() and CONCAT() functions.

In [13]:
%%sql
SELECT 
    employee_name,
    CONCAT(LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov') AS new_email
FROM
    md_water_services.employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Amara Jengo', 'amara.jengo@ndogowater.gov'),
 ('Bello Azibo', 'bello.azibo@ndogowater.gov'),
 ('Bakari Iniko', 'bakari.iniko@ndogowater.gov'),
 ('Malachi Mavuso', 'malachi.mavuso@ndogowater.gov'),
 ('Cheche Buhle', 'cheche.buhle@ndogowater.gov')]

In [14]:
%%sql
UPDATE employee
SET 
    email = CONCAT(LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov');

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

### 1b. Length of Phone Number
The phone numbers should be 12 characters long, consisting of the plus sign, area code (99), and the phone number digits. However, when we use
the LENGTH(column) function, it returns 13 characters, indicating there's an extra character

In [21]:
%%sql
SELECT LENGTH(phone_number) AS Len_phone_number
FROM
    md_water_services.employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(13,), (13,), (13,), (13,), (13,)]

In [24]:
%%sql
SELECT LENGTH(RTRIM(phone_number)) AS Len_phone_number
FROM
    md_water_services.employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(12,), (12,), (12,), (12,), (12,)]

In [25]:
%%sql
UPDATE employee
SET 
    phone_number = RTRIM(phone_number);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

### 1c. Address of employees
Use the employee table to count how many of our employees live in each town

In [34]:
%%sql
SELECT 
    town_name,
    COUNT(town_name) AS Number_of_Occupants
FROM
    md_water_services.employee
GROUP BY town_name;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('Ilanga', 3),
 ('Rural', 29),
 ('Lusaka', 4),
 ('Zanzibar', 4),
 ('Dahabu', 6),
 ('Kintampo', 1),
 ('Harare', 5),
 ('Yaounde', 1),
 ('Serowe', 3)]

In [140]:
%%sql
SELECT 
    province_name,
    COUNT(province_name) AS Number_of_Occupants
FROM
    md_water_services.employee
GROUP BY province_name;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Sokoto', 9),
 ('Kilimani', 12),
 ('Hawassa', 15),
 ('Akatsi', 13),
 ('Amanzi', 7)]

----
## 2. Visits table
We want to get the top three best performing workers

In [130]:
%%sql
SELECT 
    v.assigned_employee_id,
    COUNT(v.visit_count) AS Number_of_visits
FROM
    md_water_services.visits v
GROUP BY assigned_employee_id
ORDER BY Number_of_visits ASC
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(20, 15), (22, 143), (44, 218)]

In [133]:
%%sql
SELECT 
    assigned_employee_id,
    employee_name,
    Phone_Number,
    email
FROM
    md_water_services.employee
WHERE assigned_employee_id IN (1, 30, 34, 20, 22, 44);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
6 rows affected.

[(1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov'),
 (20, 'Kunto Asha', '+99176320477', 'kunto.asha@ndogowater.gov'),
 (22, 'Lesedi Kofi', '+99611183730', 'lesedi.kofi@ndogowater.gov'),
 (30, 'Pili Zola', '+99822478933', 'pili.zola@ndogowater.gov'),
 (34, 'Rudo Imani', '+99046972648', 'rudo.imani@ndogowater.gov'),
 (44, 'Wambui Jabali', '+99269319001', 'wambui.jabali@ndogowater.gov')]

----
## 3. Location table

In [58]:
%%sql
SELECT *
FROM md_water_services.location
LIMIT 3

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('AkHa00000', '2 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00001', '10 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00002', '9 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban')]

Create a query that counts the number of records per town

In [62]:
%%sql
SELECT 
    town_name,
    COUNT(town_name) AS records_per_town
FROM
    md_water_services.location
GROUP BY town_name
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Harare', 1650),
 ('Kintampo', 780),
 ('Lusaka', 1070),
 ('Rural', 23740),
 ('Abidjan', 400)]

Create a query that counts the number of records per province

In [61]:
%%sql
SELECT 
    province_name,
    COUNT(province_name) records_per_province
FROM
    md_water_services.location
GROUP BY province_name
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', 8940),
 ('Amanzi', 6950),
 ('Hawassa', 6030),
 ('Kilimani', 9510),
 ('Sokoto', 8220)]

v

In [68]:
%%sql
SELECT 
    province_name,
    town_name,
    COUNT(town_name) AS records_per_town
FROM
    md_water_services.location
GROUP BY province_name, town_name
ORDER BY province_name, records_per_town DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100)]

Create a query that counts the number of records per location type

In [78]:
%%sql
SELECT 
    location_type,
    COUNT(location_type) records_per_location
FROM
    md_water_services.location
GROUP BY location_type
ORDER BY records_per_location DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[('Rural', 23740), ('Urban', 15910)]

In [83]:
%%sql
SELECT 
    location_type,
    COUNT(location_type) AS records_per_location,
    ROUND(COUNT(location_type) / (SELECT COUNT(location_type) FROM md_water_services.location) * 100, 2) AS percentage_per_location
FROM
    md_water_services.location
GROUP BY location_type
ORDER BY percentage_per_location DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[('Rural', 23740, Decimal('59.87')), ('Urban', 15910, Decimal('40.13'))]

----
## 4. Water sources table

In [85]:
%%sql
SELECT * FROM md_water_services.water_source
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkHa00000224', 'tap_in_home', 956),
 ('AkHa00001224', 'tap_in_home_broken', 930),
 ('AkHa00002224', 'tap_in_home_broken', 486),
 ('AkHa00003224', 'well', 364),
 ('AkHa00004224', 'tap_in_home_broken', 942)]

#### A. How many people did we survey in total?

In [86]:
%%sql
SELECT SUM(number_of_people_served) AS Number_of_survey
FROM md_water_services.water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('27628140'),)]

#### B. How many wells, taps and rivers are there?

In [87]:
%%sql
SELECT 
    type_of_water_source,
    COUNT(number_of_people_served) AS Number_of_water_source
FROM
    md_water_services.water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', 7265),
 ('tap_in_home_broken', 5856),
 ('well', 17383),
 ('shared_tap', 5767),
 ('river', 3379)]

#### C. How many people share particular types of water sources on average?

In [93]:
%%sql
SELECT 
    type_of_water_source,
    ROUND(AVG(number_of_people_served), 0) AS average_of_water_source
FROM
    md_water_services.water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', Decimal('644')),
 ('tap_in_home_broken', Decimal('649')),
 ('well', Decimal('279')),
 ('shared_tap', Decimal('2071')),
 ('river', Decimal('699'))]

#### D.  How many people are getting water from each type of source?

In [102]:
%%sql
SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS population_served
FROM
    md_water_services.water_source
GROUP BY type_of_water_source 
ORDER BY population_served DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272')),
 ('well', Decimal('4841724')),
 ('tap_in_home', Decimal('4678880')),
 ('tap_in_home_broken', Decimal('3799720')),
 ('river', Decimal('2362544'))]

In [99]:
%%sql
SELECT 
    type_of_water_source,
    COUNT(type_of_water_source) AS records_per_source,
    ROUND(SUM(number_of_people_served) / (SELECT SUM(number_of_people_served) FROM md_water_services.water_source) * 100, 0) AS percentage_per_location
FROM
    md_water_services.water_source
GROUP BY type_of_water_source
ORDER BY percentage_per_location DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', 5767, Decimal('43')),
 ('well', 17383, Decimal('18')),
 ('tap_in_home', 7265, Decimal('17')),
 ('tap_in_home_broken', 5856, Decimal('14')),
 ('river', 3379, Decimal('9'))]

In [106]:
%%sql
SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS population_served,
    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS Priority
FROM
    md_water_services.water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), 1),
 ('well', Decimal('4841724'), 2),
 ('tap_in_home', Decimal('4678880'), 3),
 ('tap_in_home_broken', Decimal('3799720'), 4),
 ('river', Decimal('2362544'), 5)]

In [110]:
%%sql
SELECT 
    source_id,
    type_of_water_source,
    number_of_people_served,
    RANK() OVER (PARTITION BY type_of_water_source ORDER BY number_of_people_served DESC) AS priority
FROM
    md_water_services.water_source
ORDER BY type_of_water_source, priority
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu36791224', 'river', 998, 1),
 ('SoRu36238224', 'river', 998, 1),
 ('SoRu36880224', 'river', 998, 1),
 ('SoRu37756224', 'river', 998, 1),
 ('SoRu38142224', 'river', 998, 1)]

In [111]:
%%sql
SELECT 
    source_id,
    type_of_water_source,
    number_of_people_served,
    DENSE_RANK() OVER (PARTITION BY type_of_water_source ORDER BY number_of_people_served DESC) AS priority
FROM
    md_water_services.water_source
ORDER BY type_of_water_source, priority
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu36791224', 'river', 998, 1),
 ('SoRu36238224', 'river', 998, 1),
 ('SoRu36880224', 'river', 998, 1),
 ('SoRu37756224', 'river', 998, 1),
 ('SoRu38142224', 'river', 998, 1)]

In [112]:
%%sql
SELECT 
    source_id,
    type_of_water_source,
    number_of_people_served,
    ROW_NUMBER() OVER (PARTITION BY type_of_water_source ORDER BY number_of_people_served DESC) AS priority
FROM
    md_water_services.water_source
ORDER BY type_of_water_source, priority
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu36791224', 'river', 998, 1),
 ('SoRu36238224', 'river', 998, 2),
 ('SoRu36880224', 'river', 998, 3),
 ('SoRu37756224', 'river', 998, 4),
 ('SoRu38142224', 'river', 998, 5)]

----
# 5. Visits table

In [113]:
%%sql
SELECT * FROM md_water_services.visits
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'SoIl32582', 'SoIl32582224', datetime.datetime(2021, 1, 1, 9, 10), 1, 15, 12),
 (1, 'KiRu28935', 'KiRu28935224', datetime.datetime(2021, 1, 1, 9, 17), 1, 0, 46),
 (2, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 1, 9, 36), 1, 62, 40),
 (3, 'AkLu01628', 'AkLu01628224', datetime.datetime(2021, 1, 1, 9, 53), 1, 0, 1),
 (4, 'AkRu03357', 'AkRu03357224', datetime.datetime(2021, 1, 1, 10, 11), 1, 28, 14)]

#### A.  How long did the survey take?
To calculate how long the survey took, we need to get the first and last dates (which functions can find the largest/smallest value), and subtract
them. Remember with DateTime data, we can't just subtract the values. We have to use a function to get the difference in days.

In [ ]:
%%sql
SELECT
    source_id,
    DATEDIFF(MAX(time_of_record), MIN(time_of_record)) AS survey_duration_in_days
FROM
    md_water_services.visits
GROUP BY source_id;

#### B.  What is the average total queue time for water?

In [115]:
%%sql
SELECT
    AVG(NULLIF(time_in_queue, 0)) AS average_queue_time
FROM
    md_water_services.visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('123.2574'),)]

#### C.  What is the average queue time on different days?

In [120]:
%%sql
SELECT
    DAYNAME(time_of_record) AS day_of_week,
    ROUND(AVG(NULLIF(time_in_queue, 0)), 0) AS avg_queue_time
FROM
    md_water_services.visits
GROUP BY DAYNAME(time_of_record)
ORDER BY MIN(DAYOFWEEK(time_of_record));

 * mysql+pymysql://root:***@localhost:3306/md_water_services
7 rows affected.

[('Sunday', Decimal('82')),
 ('Monday', Decimal('137')),
 ('Tuesday', Decimal('108')),
 ('Wednesday', Decimal('97')),
 ('Thursday', Decimal('105')),
 ('Friday', Decimal('120')),
 ('Saturday', Decimal('246'))]

#### D. We can also look at what time during the day people collect water. Try to order the results in a meaningful way.

In [122]:
%%sql
SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS day_of_week,
    ROUND(AVG(NULLIF(time_in_queue, 0)), 0) AS avg_queue_time
FROM
    md_water_services.visits
GROUP BY TIME_FORMAT(TIME(time_of_record), '%H:00')
ORDER BY MIN(TIME(time_of_record));

 * mysql+pymysql://root:***@localhost:3306/md_water_services
14 rows affected.

[('06:00', Decimal('149')),
 ('07:00', Decimal('149')),
 ('08:00', Decimal('149')),
 ('09:00', Decimal('118')),
 ('10:00', Decimal('114')),
 ('11:00', Decimal('111')),
 ('12:00', Decimal('112')),
 ('13:00', Decimal('115')),
 ('14:00', Decimal('114')),
 ('15:00', Decimal('114')),
 ('16:00', Decimal('114')),
 ('17:00', Decimal('149')),
 ('18:00', Decimal('147')),
 ('19:00', Decimal('168'))]

In [129]:
%%sql
SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Sunday,
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Monday,
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Tuesday,
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Wednesday,
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Thursday,
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Friday,
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Saturday
FROM
    md_water_services.visits
WHERE
    time_in_queue != 0 
GROUP BY
    hour_of_day
ORDER BY
    hour_of_day;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
14 rows affected.

[('06:00', Decimal('79'), Decimal('190'), Decimal('134'), Decimal('112'), Decimal('134'), Decimal('153'), Decimal('247')),
 ('07:00', Decimal('82'), Decimal('186'), Decimal('128'), Decimal('111'), Decimal('139'), Decimal('156'), Decimal('247')),
 ('08:00', Decimal('86'), Decimal('183'), Decimal('130'), Decimal('119'), Decimal('129'), Decimal('153'), Decimal('247')),
 ('09:00', Decimal('84'), Decimal('127'), Decimal('105'), Decimal('94'), Decimal('99'), Decimal('107'), Decimal('252')),
 ('10:00', Decimal('83'), Decimal('119'), Decimal('99'), Decimal('89'), Decimal('95'), Decimal('112'), Decimal('259')),
 ('11:00', Decimal('78'), Decimal('115'), Decimal('102'), Decimal('86'), Decimal('99'), Decimal('104'), Decimal('236')),
 ('12:00', Decimal('78'), Decimal('115'), Decimal('97'), Decimal('88'), Decimal('96'), Decimal('109'), Decimal('239')),
 ('13:00', Decimal('81'), Decimal('122'), Decimal('97'), Decimal('98'), Decimal('101'), Decimal('115'), Decimal('242')),
 ('14:00', Decimal('83'), Decimal('127'), Decimal('104'), Decimal('92'), Decimal('96'), Decimal('110'), Decimal('244')),
 ('15:00', Decimal('83'), Decimal('126'), Decimal('104'), Decimal('88'), Decimal('92'), Decimal('110'), Decimal('248')),
 ('16:00', Decimal('83'), Decimal('127'), Decimal('99'), Decimal('90'), Decimal('99'), Decimal('109'), Decimal('251')),
 ('17:00', Decimal('79'), Decimal('181'), Decimal('135'), Decimal('121'), Decimal('129'), Decimal('151'), Decimal('251')),
 ('18:00', Decimal('80'), Decimal('174'), Decimal('122'), Decimal('113'), Decimal('132'), Decimal('158'), Decimal('240')),
 ('19:00', Decimal('127'), Decimal('159'), Decimal('145'), Decimal('176'), Decimal('137'), Decimal('103'), Decimal('282'))]

In [141]:
%%sql
SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
    ROUND(AVG(
        CASE
            WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
            ELSE NULL
        END
    ), 0) AS Sunday
    FROM
    md_water_services.visits
WHERE
    time_in_queue != 0 
GROUP BY
    hour_of_day
ORDER BY
    hour_of_day;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
14 rows affected.

[('06:00', Decimal('79')),
 ('07:00', Decimal('82')),
 ('08:00', Decimal('86')),
 ('09:00', Decimal('84')),
 ('10:00', Decimal('83')),
 ('11:00', Decimal('78')),
 ('12:00', Decimal('78')),
 ('13:00', Decimal('81')),
 ('14:00', Decimal('83')),
 ('15:00', Decimal('83')),
 ('16:00', Decimal('83')),
 ('17:00', Decimal('79')),
 ('18:00', Decimal('80')),
 ('19:00', Decimal('127'))]